W6D3&W6D4/first_routes/app/controllers/artworks_controller.rb

    def index
        if params.has_key?(:user_id) #params is a hash like object that has parameters from get request (clarify with ta)
            @artworks = Artwork
                .select('DISTINCT *')
                .joins(:artwork_shares)
                .where('artworks.artist_id = :id OR artwork_shares.viewer_id = :id', id: params[:user_id]) #might be artist_id and would be user's artwork, and would be hash-like object
---
SELECT DISTINCT * FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (artworks.artist_id = '9' OR artwork_shares.viewer_id = '9')

    def show
        @artwork = Artwork.find_by(id: params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def create
        @artwork = Artwork.new(artwork_params)
        if @artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "hello"], ["image_url", "https://www.google.com/images?=hello"], ["artist_id", 5]]