W6D3&W6D4/first_routes/app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares"
---
    def index
        @artwork_shares = ArtworkShare.all

INSERT INTO "artwork_shares" ("artist_id", "artwork_id") VALUES ($1, $2) RETURNING "id"  [["artist_id", 6], ["artwork_id", 3]]
---
    def create
        @artwork_share = ArtworkShare.new(artwork_share_params)
        if @artwork_share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 5]]
---
    def destroy
        @artwork_share = ArtworkShare.find_by(id: params[:id])

        if @artwork_share.destroy