W6D3&W6D4/first_routes/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Brandon"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index
        if params.has_key?(:username)
            @user = User
                    .where("users.username ILIKE '%#{params[:username]}%'")
            render json: @user
        else
            @users = User.all

INSERT INTO "users" ("username") VALUES ($1) RETURNING "id"  [["username", "Brian"]]
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "Andy"], ["id", 2]]
---
    def update
        @user = User.find_by(id: params[:id])

        if @user.update(user_params)