W6D5/NinetyNineCats/app/controllers/cats_controller.rb

    def create # an action to submit the form to
        @cat = Cat.new(cat_params)

        if @cat.save
---
INSERT INTO "cats" ("name", "color", "sex", "description", "birth_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def edit # A route that leads to a form that submits that info to the update route action
        @cat = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def update
        @cat = Cat.find_by(id: params[:id])

        if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "asda"], ["updated_at", "2020-06-20 20:49:00.003931"], ["id", 3]]